@ocofaigh, the pipeline keeps failing due to a timeout after 6 hours as add-ons test stuck. The upgrade test is also failing because we updated the default value, and the re-plan shows one resource being updated in place.
Should we skip the upgrade test in this case?

```
2025/12/02 20:33:51 Terraform plan | Terraform used the selected providers to generate the following execution
 2025/12/02 20:33:51 Terraform plan | plan. Resource actions are indicated with the following symbols:
 2025/12/02 20:33:51 Terraform plan |   ~ update in-place
 2025/12/02 20:33:51 Terraform plan | 
 2025/12/02 20:33:51 Terraform plan | Terraform will perform the following actions:
 2025/12/02 20:33:51 Terraform plan | 
 2025/12/02 20:33:51 Terraform plan |   # module.ocp_base.ibm_container_addons.addons will be updated in-place
 2025/12/02 20:33:51 Terraform plan |   ~ resource "ibm_container_addons" "addons" {
 2025/12/02 20:33:51 Terraform plan |         id                = "d4njufpz00pgg3l2l5lg"
 2025/12/02 20:33:51 Terraform plan |         # (4 unchanged attributes hidden)
 2025/12/02 20:33:51 Terraform plan | 
 2025/12/02 20:33:51 Terraform plan |       - addons {
 2025/12/02 20:33:51 Terraform plan |           - allowed_upgrade_versions = [
 2025/12/02 20:33:51 Terraform plan |               - "417",
 2025/12/02 20:33:51 Terraform plan |             ] -> null
 2025/12/02 20:33:51 Terraform plan |           - deprecated               = false -> null
 2025/12/02 20:33:51 Terraform plan |           - health_state             = "normal" -> null
 2025/12/02 20:33:51 Terraform plan |           - health_status            = "Addon Ready. For more info: http://ibm.biz/addon-state (H1500)" -> null
 2025/12/02 20:33:51 Terraform plan |           - name                     = "openshift-ai" -> null
 2025/12/02 20:33:51 Terraform plan |           - options                  = <<-EOT
 2025/12/02 20:33:51 Terraform plan |                 apiVersion: v1
 2025/12/02 20:33:51 Terraform plan |                 kind: ConfigMap
 2025/12/02 20:33:51 Terraform plan |                 metadata:
 2025/12/02 20:33:51 Terraform plan |                   name: managed-addon-rhoai-options
 2025/12/02 20:33:51 Terraform plan |                   namespace: kube-system
 2025/12/02 20:33:51 Terraform plan |                   labels:
 2025/12/02 20:33:51 Terraform plan |                     addonmanager.kubernetes.io/mode: EnsureExists
 2025/12/02 20:33:51 Terraform plan |                 data:
 2025/12/02 20:33:51 Terraform plan |                   nfdEnabled: "true"
 2025/12/02 20:33:51 Terraform plan |                   nfdDeletePolicy: "retain"
 2025/12/02 20:33:51 Terraform plan |                   nvidiaEnabled: "true"
 2025/12/02 20:33:51 Terraform plan |                   nvidiaDeletePolicy: "retain"
 2025/12/02 20:33:51 Terraform plan |                   nvidiaSandboxWorkloads: "false"
 2025/12/02 20:33:51 Terraform plan |                   nvidiaSandboxDevicePluginEnabled: "true"
 2025/12/02 20:33:51 Terraform plan |                   nvidiaDcgmEnabled: "true"
 2025/12/02 20:33:51 Terraform plan |                   nvidiaMigManagerEnabled: "true"
 2025/12/02 20:33:51 Terraform plan |                   nvidiaVgpuManagerEnabled: "true"
 2025/12/02 20:33:51 Terraform plan |                   nvidiaVgpuDeviceManagerEnabled: "false"
 2025/12/02 20:33:51 Terraform plan |                   nvidiaVfioManagerEnabled: "true"
 2025/12/02 20:33:51 Terraform plan |                   nvidiaGpuDirectStorageEnabled: "false"
 2025/12/02 20:33:51 Terraform plan |                   nvidiaNodeStatusExporterEnabled: "true"
 2025/12/02 20:33:51 Terraform plan |                   nvidiaCudaTest: "false"
 2025/12/02 20:33:51 Terraform plan |                   oaiDeletePolicy: "retain"
 2025/12/02 20:33:51 Terraform plan |                   oaiInstallPlanApproval: "Automatic"
 2025/12/02 20:33:51 Terraform plan |                   oaiCodeflare: "Managed"
 2025/12/02 20:33:51 Terraform plan |                   oaiDashboard: "Managed"
 2025/12/02 20:33:51 Terraform plan |                   oaiDataSciencePipelines: "Managed"
 2025/12/02 20:33:51 Terraform plan |                   oaiModelmeshserving: "Managed"
 2025/12/02 20:33:51 Terraform plan |                   oaiKserve: "Managed"
 2025/12/02 20:33:51 Terraform plan |                   oaiKueue: "Managed"
 2025/12/02 20:33:51 Terraform plan |                   oaiRay: "Managed"
 2025/12/02 20:33:51 Terraform plan |                   oaiWorkbenches: "Managed"
 2025/12/02 20:33:51 Terraform plan |                   pipelineEnabled: "true"
 2025/12/02 20:33:51 Terraform plan |                   pipelineDeletePolicy: "retain"
 2025/12/02 20:33:51 Terraform plan |             EOT -> null
 2025/12/02 20:33:51 Terraform plan |           - target_version           = "417" -> null
 2025/12/02 20:33:51 Terraform plan |           - version                  = "416" -> null
 2025/12/02 20:33:51 Terraform plan |           - vlan_spanning_required   = false -> null
 2025/12/02 20:33:51 Terraform plan |             # (4 unchanged attributes hidden)
 2025/12/02 20:33:51 Terraform plan |         }
 2025/12/02 20:33:51 Terraform plan |       + addons {
 2025/12/02 20:33:51 Terraform plan |           + allowed_upgrade_versions = (known after apply)
 2025/12/02 20:33:51 Terraform plan |           + deprecated               = (known after apply)
 2025/12/02 20:33:51 Terraform plan |           + health_state             = (known after apply)
 2025/12/02 20:33:51 Terraform plan |           + health_status            = (known after apply)
 2025/12/02 20:33:51 Terraform plan |           + min_kube_version         = (known after apply)
 2025/12/02 20:33:51 Terraform plan |           + min_ocp_version          = (known after apply)
 2025/12/02 20:33:51 Terraform plan |           + name                     = "openshift-ai"
 2025/12/02 20:33:51 Terraform plan |           + options                  = (known after apply)
 2025/12/02 20:33:51 Terraform plan |           + supported_kube_range     = (known after apply)
 2025/12/02 20:33:51 Terraform plan |           + target_version           = (known after apply)
 2025/12/02 20:33:51 Terraform plan |           + version                  = "418"
 2025/12/02 20:33:51 Terraform plan |           + vlan_spanning_required   = (known after apply)
 2025/12/02 20:33:51 Terraform plan |             # (1 unchanged attribute hidden)
 2025/12/02 20:33:51 Terraform plan |         }
 2025/12/02 20:33:51 Terraform plan | 
 2025/12/02 20:33:51 Terraform plan |         # (2 unchanged blocks hidden)
 2025/12/02 20:33:51 Terraform plan |     }
 2025/12/02 20:33:51 Terraform plan | 
 2025/12/02 20:33:51 Terraform plan | Plan: 0 to add, 1 to change, 0 to destroy.
 2025/12/02 20:33:52 Command finished successfully.
```